app/views/stations/index.html.erb

    <% @stations.each do |station| %>
      <%if station.posts.length >= 1 %>
---
SELECT "posts".* FROM "posts" INNER JOIN "posts_stations" ON "posts"."id" = "posts_stations"."post_id" WHERE "posts_stations"."station_id" = $1  [["station_id", 1]]