app/views/posts/show.html.erb

  <h2 class="media-heading"><%= link_to @post.title, "/posts/#{@post.id}"%></h2>
  <p><%= @post.user.first_name %> <%= @post.user.last_name %> @<%= @post.user.username %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]