app/controllers/lines_controller.rb

SELECT "lines".* FROM "lines"
---
  def index
    @lines = Line.all