app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "date_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["body", "Test Post"], ["date_time", 2016-08-06 12:57:00 UTC], ["user_id", 1], ["created_at", 2016-08-06 12:57:54 UTC], ["updated_at", 2016-08-06 12:57:54 UTC]]
---
  def create
    # @post = Post.new(post_params)
    @post = current_user.posts.new(post_params)


    respond_to do |format|
      if @post.save