app/controllers/stations_controller.rb

  def index
    @stations = Station.all
---
SELECT "stations".* FROM "stations"

  def create
    @station = Station.new(station_params)
    @lines = Line.all

    respond_to do |format|
      if @station.save
---
INSERT INTO "stations" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bank"], ["created_at", 2016-08-07 11:13:44 UTC], ["updated_at", 2016-08-07 11:13:44 UTC]]

    def set_station
      @station = Station.find(params[:id])
---
SELECT  "stations".* FROM "stations" WHERE "stations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]